src/ExchangePlans/МобильноеПриложение/МобильноеПриложение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="02d384bc-5675-41bb-9ba8-9f5634dca527">
  <name>МобильноеПриложение</name>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияФорматаОбмена</name>
    <comment>Версия формата обмена в формате ХХ.ХХ.ХХ.ХХ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыгружаемогоПериода</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОперацииТолькоПоУказаннымКошелькам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятого</name>
    <comment>Дата принятого пакета</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатребованныйСценарий</name>
    <comment>Сценарий, по которому удаленный узел должен подготовить и вернуть данные</comment>
    <type>
      <types>EnumRef.СценарииОбменаСМобильнымПриложением</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыгружаемыхПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МобильноеУстройство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательБазы</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательМобильногоУстройства</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияЗапрещена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Кошельки</name>
    <attributes>
      <name>Кошелек</name>
      <type>
        <types>CatalogRef.КошелькиИСчета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

src/InformationRegisters/ИзмененияОбъектовВоВнешнихПрограммах/ИзмененияОбъектовВоВнешнихПрограммах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзмененияОбъектовВоВнешнихПрограммах</name>
  <resources>
    <name>НомерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаПолученияИзменений</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоИзменения</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
</mdclass:Enum>

src/ExchangePlans/МобильноеПриложение/Forms/ФормаУзла/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЭтотУзел = Объект.Ссылка = ПланыОбмена.МобильноеПриложение.ЭтотУзел();
	
	Если НЕ ЗначениеЗаполнено(Объект.КоличествоВыгружаемыхПериодов) Тогда
		КоличествоВыгружаемыхПериодов = 1;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидВыгружаемогоПериода) Тогда
		ВидВыгружаемогоПериода = Перечисления.Периодичность.Месяц;
	КонецЕсли; 
	
	Элементы.Код.Заголовок = ?(ЭтотУзел, 
		НСтр("ru = 'Код центральной базы'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		НСтр("ru = 'Код мобильного устройства'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()) );
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если Не ЗавершениеРаботы Тогда
		Оповестить("Запись_УзелПланаОбмена");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбменДаннымиСервер.ФормаУзлаПриЗаписиНаСервере(ТекущийОбъект, Отказ);
КонецПроцедуры


#КонецОбласти




#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СписокУстройствОткрытьСписокПолученныхИзменений(Команда)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("МестоИзменения", Объект.Ссылка);
	
	ОткрытьФорму("РегистрСведений.ИзмененияОбъектовВоВнешнихПрограммах.ФормаСписка", Новый Структура("Отбор", СтруктураОтбора));
	
КонецПроцедуры
 

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Элементы.НомерОтправленного.Доступность  = НЕ Форма.ЭтотУзел;
	Элементы.НомерПринятого.Доступность      = НЕ Форма.ЭтотУзел;
	Элементы.Активность.Доступность          = НЕ Форма.ЭтотУзел;
	
КонецПроцедуры


#КонецОбласти
